## Kegiatan Belajar 1 : Pengenalan Pandas

### 1. Memulai Penggunaan Library Pandas

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

### 2. object Creation

In [4]:
s = pd.Series ([1,3,5,np.nan,6,8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [7]:
dates = pd.date_range('20130101', periods=6)

In [8]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, 
    columns=list('ABCD'))

In [11]:
df

                   A         B         C         D
2013-01-01  1.226106 -1.373996  0.340374 -0.421718
2013-01-02 -0.218776 -0.579260 -1.165947 -1.310849
2013-01-03 -0.109167  0.910722 -0.051283  0.010610
2013-01-04  0.031283  0.301742  0.766825  0.116018
2013-01-05 -0.252247  1.485188 -0.870472 -3.226098
2013-01-06 -0.935181  0.891972  0.422930  1.412273

In [14]:
df2 = pd.DataFrame({'A' : 1.,
      'B' : pd.Timestamp('20130102'),
      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
      'D' : np. array ([3] * 4,dtype='int32'),
      'E' : pd.Categorical(["test","train","test","train"]),
      'F' : 'foo'})

In [15]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [16]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

### 3. Viewing Data

In [17]:
df.head()

                   A         B         C         D
2013-01-01  1.226106 -1.373996  0.340374 -0.421718
2013-01-02 -0.218776 -0.579260 -1.165947 -1.310849
2013-01-03 -0.109167  0.910722 -0.051283  0.010610
2013-01-04  0.031283  0.301742  0.766825  0.116018
2013-01-05 -0.252247  1.485188 -0.870472 -3.226098

In [19]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.031283  0.301742  0.766825  0.116018
2013-01-05 -0.252247  1.485188 -0.870472 -3.226098
2013-01-06 -0.935181  0.891972  0.422930  1.412273

In [20]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [22]:
df.values

array([[ 1.22610575, -1.37399647,  0.34037418, -0.42171782],
       [-0.21877559, -0.57926011, -1.16594735, -1.31084912],
       [-0.10916725,  0.91072186, -0.0512825 ,  0.01060983],
       [ 0.03128298,  0.30174191,  0.76682485,  0.1160184 ],
       [-0.25224697,  1.48518835, -0.87047243, -3.22609788],
       [-0.93518062,  0.89197236,  0.42292963,  1.41227291]])

In [24]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.042997  0.272728 -0.092929 -0.569961
std    0.705860  1.067613  0.768208  1.572440
min   -0.935181 -1.373996 -1.165947 -3.226098
25%   -0.243879 -0.359010 -0.665675 -1.088566
50%   -0.163971  0.596857  0.144546 -0.205554
75%   -0.003830  0.906034  0.402291  0.089666
max    1.226106  1.485188  0.766825  1.412273

In [25]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.226106   -0.218776   -0.109167    0.031283   -0.252247   -0.935181
B   -1.373996   -0.579260    0.910722    0.301742    1.485188    0.891972
C    0.340374   -1.165947   -0.051283    0.766825   -0.870472    0.422930
D   -0.421718   -1.310849    0.010610    0.116018   -3.226098    1.412273

In [26]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.421718  0.340374 -1.373996  1.226106
2013-01-02 -1.310849 -1.165947 -0.579260 -0.218776
2013-01-03  0.010610 -0.051283  0.910722 -0.109167
2013-01-04  0.116018  0.766825  0.301742  0.031283
2013-01-05 -3.226098 -0.870472  1.485188 -0.252247
2013-01-06  1.412273  0.422930  0.891972 -0.935181

In [27]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  1.226106 -1.373996  0.340374 -0.421718
2013-01-02 -0.218776 -0.579260 -1.165947 -1.310849
2013-01-04  0.031283  0.301742  0.766825  0.116018
2013-01-06 -0.935181  0.891972  0.422930  1.412273
2013-01-03 -0.109167  0.910722 -0.051283  0.010610
2013-01-05 -0.252247  1.485188 -0.870472 -3.226098

### 4. Selection

In [28]:
df['A']

2013-01-01    1.226106
2013-01-02   -0.218776
2013-01-03   -0.109167
2013-01-04    0.031283
2013-01-05   -0.252247
2013-01-06   -0.935181
Freq: D, Name: A, dtype: float64

In [29]:
df[0:3]

                   A         B         C         D
2013-01-01  1.226106 -1.373996  0.340374 -0.421718
2013-01-02 -0.218776 -0.579260 -1.165947 -1.310849
2013-01-03 -0.109167  0.910722 -0.051283  0.010610

In [30]:
df['20130102' : '20130104']

                   A         B         C         D
2013-01-02 -0.218776 -0.579260 -1.165947 -1.310849
2013-01-03 -0.109167  0.910722 -0.051283  0.010610
2013-01-04  0.031283  0.301742  0.766825  0.116018

In [31]:
df.loc[dates[0]]

A    1.226106
B   -1.373996
C    0.340374
D   -0.421718
Name: 2013-01-01 00:00:00, dtype: float64

In [35]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  1.226106 -1.373996
2013-01-02 -0.218776 -0.579260
2013-01-03 -0.109167  0.910722
2013-01-04  0.031283  0.301742
2013-01-05 -0.252247  1.485188
2013-01-06 -0.935181  0.891972

In [36]:
df.loc['20130102' : '20130104',['A','B']]

                   A         B
2013-01-02 -0.218776 -0.579260
2013-01-03 -0.109167  0.910722
2013-01-04  0.031283  0.301742

In [37]:
df.loc['20130102',['A','B']]

A   -0.218776
B   -0.579260
Name: 2013-01-02 00:00:00, dtype: float64

In [38]:
df.loc[dates[0],'A']

1.2261057547920362

In [39]:
df.at[dates[0],'A']

1.2261057547920362

In [40]:
df.iloc[3]

A    0.031283
B    0.301742
C    0.766825
D    0.116018
Name: 2013-01-04 00:00:00, dtype: float64

In [41]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.031283  0.301742
2013-01-05 -0.252247  1.485188

In [42]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.218776 -1.165947
2013-01-03 -0.109167 -0.051283
2013-01-05 -0.252247 -0.870472

In [43]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.218776 -0.579260 -1.165947 -1.310849
2013-01-03 -0.109167  0.910722 -0.051283  0.010610

In [44]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -1.373996  0.340374
2013-01-02 -0.579260 -1.165947
2013-01-03  0.910722 -0.051283
2013-01-04  0.301742  0.766825
2013-01-05  1.485188 -0.870472
2013-01-06  0.891972  0.422930

In [45]:
df.iloc[1,1]

-0.5792601079743996

In [46]:
df.iat[1,1]

-0.5792601079743996

### 5. Boolean Indexing

In [51]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  1.226106 -1.373996  0.340374 -0.421718
2013-01-04  0.031283  0.301742  0.766825  0.116018

In [52]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.226106       NaN  0.340374       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03       NaN  0.910722       NaN  0.010610
2013-01-04  0.031283  0.301742  0.766825  0.116018
2013-01-05       NaN  1.485188       NaN       NaN
2013-01-06       NaN  0.891972  0.422930  1.412273

In [53]:
df2 = df.copy()

In [54]:
df2['E']=['one','one','two','three','four','three']

In [55]:
df2

                   A         B         C         D      E
2013-01-01  1.226106 -1.373996  0.340374 -0.421718    one
2013-01-02 -0.218776 -0.579260 -1.165947 -1.310849    one
2013-01-03 -0.109167  0.910722 -0.051283  0.010610    two
2013-01-04  0.031283  0.301742  0.766825  0.116018  three
2013-01-05 -0.252247  1.485188 -0.870472 -3.226098   four
2013-01-06 -0.935181  0.891972  0.422930  1.412273  three

In [56]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.109167  0.910722 -0.051283  0.010610   two
2013-01-05 -0.252247  1.485188 -0.870472 -3.226098  four

### 6. Setting

In [57]:
s1 = pd.Series([1,2,3,4,5,6], index =
     pd.date_range('20130102', periods=6))

In [58]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [59]:
df['F'] = s1

In [60]:
df.at[dates[0], 'A'] = 0

In [61]:
df.loc[:,'D']=np.array([5]*len(df))

In [62]:
df

                   A         B         C  D    F
2013-01-01  0.000000 -1.373996  0.340374  5  NaN
2013-01-02 -0.218776 -0.579260 -1.165947  5  1.0
2013-01-03 -0.109167  0.910722 -0.051283  5  2.0
2013-01-04  0.031283  0.301742  0.766825  5  3.0
2013-01-05 -0.252247  1.485188 -0.870472  5  4.0
2013-01-06 -0.935181  0.891972  0.422930  5  5.0

In [63]:
df2 = df.copy()

In [64]:
df2[df2 > 0] = -df2

In [65]:
df2

                   A         B         C  D    F
2013-01-01  0.000000 -1.373996 -0.340374 -5  NaN
2013-01-02 -0.218776 -0.579260 -1.165947 -5 -1.0
2013-01-03 -0.109167 -0.910722 -0.051283 -5 -2.0
2013-01-04 -0.031283 -0.301742 -0.766825 -5 -3.0
2013-01-05 -0.252247 -1.485188 -0.870472 -5 -4.0
2013-01-06 -0.935181 -0.891972 -0.422930 -5 -5.0

## Kegiatan Belajar 2 : Persiapan dan Praproses Data

### 1. Menyimpan dan Membaca Data ke/dari File

In [66]:
df.to_csv('foo.csv')

In [67]:
pd.read_csv('foo.csv')

   Unnamed: 0         A         B         C  D    F
0  2013-01-01  0.000000 -1.373996  0.340374  5  NaN
1  2013-01-02 -0.218776 -0.579260 -1.165947  5  1.0
2  2013-01-03 -0.109167  0.910722 -0.051283  5  2.0
3  2013-01-04  0.031283  0.301742  0.766825  5  3.0
4  2013-01-05 -0.252247  1.485188 -0.870472  5  4.0
5  2013-01-06 -0.935181  0.891972  0.422930  5  5.0

In [68]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

ModuleNotFoundError: No module named 'openpyxl'